### Handling SQL DB files

In [5]:
import pandas as pd
import sqlite3

In [2]:
# This is the basic Carsales DataFrame
Cardata = { "Mercedes": [2, 4, 0, 4, 0, 3], "Ford": [3, 0, 0, 1, 6, 12], "Tata":[9, 3, 4, 1, 0, 0], "Renault":[12, 1, 0, 0, 3, 1]}
Carsales = pd.DataFrame(Cardata)
Carsales.index.rename("Sales place", inplace=True)
Carsales.rename(index={0: "One", 1: "Two", 2: "Three", 3: "Four", 4: "Five", 5: "Six"}, inplace=True)

In [3]:
Carsales

             Mercedes  Ford  Tata  Renault
Sales place
One                 2     3     9       12
Two                 4     0     3        1
Three               0     0     4        0
Four                4     1     1        0
Five                0     6     0        3
Six                 3    12     0        1

In [7]:
#Create a db file and a table in it using the DataFrame
Conn = sqlite3.connect('Carsales.db')
Carsales.to_sql('Carsales_tbl',Conn,if_exists='replace')

6

In [8]:
del Carsales

In [9]:
#Recreate Carsales DataFrame from the table
Carsales = pd.read_sql_query('Select * from Carsales_tbl', Conn)

In [10]:
Carsales

  Sales place  Mercedes  Ford  Tata  Renault
0         One         2     3     9       12
1         Two         4     0     3        1
2       Three         0     0     4        0
3        Four         4     1     1        0
4        Five         0     6     0        3
5         Six         3    12     0        1

In [12]:
#Restore indexes
Carsales.set_index('Sales place',inplace=True)

In [29]:
Carsales

Sales Place  Mercedes  Ford  Tata  Renault
Sales Place
One                 2     3     9       12
Two                 4     0     3        1
Three               0     0     4        0
Four                4     1     1        0
Five                0     6     0        3
Six                 3    12     0        1

In [30]:
Carsales.columns.rename('Sales Place',inplace=True)

In [31]:
Carsales

Sales Place  Mercedes  Ford  Tata  Renault
Sales Place
One                 2     3     9       12
Two                 4     0     3        1
Three               0     0     4        0
Four                4     1     1        0
Five                0     6     0        3
Six                 3    12     0        1

In [32]:
Carsales.columns

Index(['Mercedes', 'Ford', 'Tata', 'Renault'], dtype='object', name='Sales Place')

In [33]:
Carsales.index

Index(['One', 'Two', 'Three', 'Four', 'Five', 'Six'], dtype='object', name='Sales Place')